C:\Users\VARUN\Desktop\CovidXRAY\Code\Model>python36 Model.py
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 99, 99, 128)       640
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 49, 49, 128)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 47, 47, 256)       295168
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 23, 23, 256)       0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 256)       590080
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 256)       0
_________________________________________________________________
dropout (Dropout)            (None, 10, 10, 256)       0
_________________________________________________________________
flatten (Flatten)            (None, 25600)             0
_________________________________________________________________
dense (Dense)                (None, 512)               13107712
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 516
=================================================================
Total params: 14,076,292
Trainable params: 14,076,292
Non-trainable params: 0
_________________________________________________________________
Epoch 1/25
2020-03-26 10:22:55.640566: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX AVX2
270/270 [==============================] - 96s 354ms/step - loss: 1.4742 - acc: 0.2370
Epoch 2/25
270/270 [==============================] - 98s 363ms/step - loss: 1.3624 - acc: 0.3370
Epoch 3/25
270/270 [==============================] - 95s 353ms/step - loss: 1.1637 - acc: 0.5667
Epoch 4/25
270/270 [==============================] - 91s 338ms/step - loss: 1.2288 - acc: 0.4815
Epoch 5/25
270/270 [==============================] - 91s 335ms/step - loss: 0.9129 - acc: 0.5444
Epoch 6/25
270/270 [==============================] - 76s 282ms/step - loss: 0.7592 - acc: 0.6556
Epoch 7/25
270/270 [==============================] - 78s 289ms/step - loss: 0.6921 - acc: 0.6963
Epoch 8/25
270/270 [==============================] - 75s 277ms/step - loss: 0.6796 - acc: 0.7148
Epoch 9/25
270/270 [==============================] - 84s 311ms/step - loss: 0.6064 - acc: 0.7333
Epoch 10/25
270/270 [==============================] - 88s 325ms/step - loss: 0.5528 - acc: 0.7593
Epoch 11/25
270/270 [==============================] - 77s 286ms/step - loss: 0.5228 - acc: 0.7741
Epoch 12/25
270/270 [==============================] - 73s 270ms/step - loss: 0.4377 - acc: 0.8037
Epoch 13/25
270/270 [==============================] - 76s 283ms/step - loss: 0.3942 - acc: 0.8185
Epoch 14/25
270/270 [==============================] - 70s 260ms/step - loss: 0.3115 - acc: 0.8704
Epoch 15/25
270/270 [==============================] - 66s 244ms/step - loss: 0.3004 - acc: 0.8667
Epoch 16/25
270/270 [==============================] - 67s 248ms/step - loss: 0.2810 - acc: 0.8741
Epoch 17/25
270/270 [==============================] - 76s 282ms/step - loss: 0.3123 - acc: 0.8704
Epoch 18/25
270/270 [==============================] - 94s 349ms/step - loss: 0.2645 - acc: 0.8889
Epoch 19/25
270/270 [==============================] - 75s 279ms/step - loss: 0.1913 - acc: 0.9222
Epoch 20/25
270/270 [==============================] - 71s 261ms/step - loss: 0.1414 - acc: 0.9259
Epoch 21/25
270/270 [==============================] - 76s 281ms/step - loss: 0.1456 - acc: 0.9444
Epoch 22/25
270/270 [==============================] - 70s 260ms/step - loss: 0.1489 - acc: 0.9444
Epoch 23/25
270/270 [==============================] - 72s 268ms/step - loss: 0.1611 - acc: 0.9296
Epoch 24/25
270/270 [==============================] - 74s 275ms/step - loss: 0.0839 - acc: 0.9815
Epoch 25/25
270/270 [==============================] - 77s 284ms/step - loss: 0.0650 - acc: 0.9778
WARNING:tensorflow:TensorFlow optimizers do not make it possible to access optimizer attributes or optimizer state after instantiation. As a result, we cannot save the optimizer as part of the model save file.You will have to compile your model again after loading it. Prefer using a Keras optimizer instead (see keras.io/optimizers).
36/36 [==============================] - 5s 127ms/step
Test accuracy: 0.6666666666666666

C:\Users\VARUN\Desktop\CovidXRAY\Code\Model>python36 Model.py
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 99, 99, 128)       640
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 49, 49, 128)       0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 47, 47, 256)       295168
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 23, 23, 256)       0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 21, 21, 256)       590080
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 10, 10, 256)       0
_________________________________________________________________
dropout (Dropout)            (None, 10, 10, 256)       0
_________________________________________________________________
flatten (Flatten)            (None, 25600)             0
_________________________________________________________________
dense (Dense)                (None, 512)               13107712
_________________________________________________________________
dense_1 (Dense)              (None, 128)               65664
_________________________________________________________________
dense_2 (Dense)              (None, 128)               16512
_________________________________________________________________
dense_3 (Dense)              (None, 4)                 516
=================================================================
Total params: 14,076,292
Trainable params: 14,076,292
Non-trainable params: 0
_________________________________________________________________
Epoch 1/35
2020-03-26 10:59:39.042305: I tensorflow/core/platform/cpu_feature_guard.cc:141] Your CPU supports instructions that this TensorFlow binary was not compiled to use: AVX AVX2
270/270 [==============================] - 63s 232ms/step - loss: 1.4090 - acc: 0.2556
Epoch 2/35
270/270 [==============================] - 61s 227ms/step - loss: 1.3724 - acc: 0.2963
Epoch 3/35
270/270 [==============================] - 61s 226ms/step - loss: 1.2049 - acc: 0.4370
Epoch 4/35
270/270 [==============================] - 62s 230ms/step - loss: 0.9241 - acc: 0.5370
Epoch 5/35
270/270 [==============================] - 63s 232ms/step - loss: 0.7917 - acc: 0.6148
Epoch 6/35
270/270 [==============================] - 62s 229ms/step - loss: 0.5924 - acc: 0.7000
Epoch 7/35
270/270 [==============================] - 63s 234ms/step - loss: 0.5447 - acc: 0.7444
Epoch 8/35
270/270 [==============================] - 62s 231ms/step - loss: 0.4590 - acc: 0.7963
Epoch 9/35
270/270 [==============================] - 62s 231ms/step - loss: 0.4166 - acc: 0.7963
Epoch 10/35
270/270 [==============================] - 62s 229ms/step - loss: 0.3689 - acc: 0.8222
Epoch 11/35
270/270 [==============================] - 57s 211ms/step - loss: 0.3459 - acc: 0.8444
Epoch 12/35
270/270 [==============================] - 56s 209ms/step - loss: 0.3558 - acc: 0.8556
Epoch 13/35
270/270 [==============================] - 57s 211ms/step - loss: 0.3268 - acc: 0.8148
Epoch 14/35
270/270 [==============================] - 62s 229ms/step - loss: 0.3311 - acc: 0.8593
Epoch 15/35
270/270 [==============================] - 62s 229ms/step - loss: 0.2320 - acc: 0.9000
Epoch 16/35
270/270 [==============================] - 61s 226ms/step - loss: 0.2149 - acc: 0.9074
Epoch 17/35
270/270 [==============================] - 62s 228ms/step - loss: 0.2100 - acc: 0.9111
Epoch 18/35
270/270 [==============================] - 62s 229ms/step - loss: 0.3387 - acc: 0.8407
Epoch 19/35
270/270 [==============================] - 61s 227ms/step - loss: 0.2516 - acc: 0.9185
Epoch 20/35
270/270 [==============================] - 63s 232ms/step - loss: 0.1887 - acc: 0.9259
Epoch 21/35
270/270 [==============================] - 66s 243ms/step - loss: 0.1317 - acc: 0.9444
Epoch 22/35
270/270 [==============================] - 61s 228ms/step - loss: 0.1150 - acc: 0.9556
Epoch 23/35
270/270 [==============================] - 62s 229ms/step - loss: 0.1025 - acc: 0.9593
Epoch 24/35
270/270 [==============================] - 58s 214ms/step - loss: 0.0913 - acc: 0.9593
Epoch 25/35
270/270 [==============================] - 57s 212ms/step - loss: 0.0633 - acc: 0.9778
Epoch 26/35
270/270 [==============================] - 57s 213ms/step - loss: 0.0956 - acc: 0.9593
Epoch 27/35
270/270 [==============================] - 57s 211ms/step - loss: 0.1189 - acc: 0.9593
Epoch 28/35
270/270 [==============================] - 58s 213ms/step - loss: 0.4655 - acc: 0.8481
Epoch 29/35
270/270 [==============================] - 63s 233ms/step - loss: 0.3039 - acc: 0.8926
Epoch 30/35
270/270 [==============================] - 67s 248ms/step - loss: 0.1813 - acc: 0.9296
Epoch 31/35
270/270 [==============================] - 61s 225ms/step - loss: 0.1518 - acc: 0.9444
Epoch 32/35
270/270 [==============================] - 61s 226ms/step - loss: 0.0682 - acc: 0.9852
Epoch 33/35
270/270 [==============================] - 62s 228ms/step - loss: 0.0407 - acc: 0.9889
Epoch 34/35
270/270 [==============================] - 61s 224ms/step - loss: 0.0640 - acc: 0.9778
Epoch 35/35
270/270 [==============================] - 61s 226ms/step - loss: 0.0802 - acc: 0.9704
WARNING:tensorflow:TensorFlow optimizers do not make it possible to access optimizer attributes or optimizer state after instantiation. As a result, we cannot save the optimizer as part of the model save file.You will have to compile your model again after loading it. Prefer using a Keras optimizer instead (see keras.io/optimizers).
36/36 [==============================] - 2s 68ms/step
Test accuracy: 0.7222222222222222